{
  "class_name": "Sequential", 
  "keras_version": "1.2.0", 
  "config": [
    {
      "class_name": "BatchNormalization", 
      "config": {
        "beta_regularizer": null, 
        "name": "batchnormalization_1", 
        "epsilon": 0.001, 
        "trainable": true,
        "input_dtype": "float32", 
        "batch_input_shape": [
          null, 
          3, 
          128, 
          128
        ], 
        "gamma_regularizer": null, 
        "momentum": 0.99, 
        "axis": 1
      }
    }, 
    {
      "class_name": "Convolution2D", 
      "config": {
        "W_constraint": null, 
        "b_constraint": null, 
        "name": "convolution2d_1", 
        "activity_regularizer": null, 
        "trainable": true, 
        "dim_ordering": "th", 
        "nb_col": 5, 
        "subsample": [
          2, 
          2
        ], 
        "init": "glorot_uniform", 
        "bias": true, 
        "nb_filter": 24, 
        "b_regularizer": null, 
        "W_regularizer": null, 
        "nb_row": 5, 
        "activation": "relu", 
        "border_mode": "valid"
      }
    }, 
    {
      "class_name": "Convolution2D", 
      "config": {
        "W_constraint": null, 
        "b_constraint": null, 
        "name": "convolution2d_2", 
        "activity_regularizer": null, 
        "trainable": true, 
        "dim_ordering": "th", 
        "nb_col": 5, 
        "subsample": [
          2, 
          2
        ], 
        "init": "glorot_uniform", 
        "bias": true, 
        "nb_filter": 36, 
        "b_regularizer": null, 
        "W_regularizer": null, 
        "nb_row": 5, 
        "activation": "relu", 
        "border_mode": "valid"
      }
    }, 
    {
      "class_name": "Convolution2D", 
      "config": {
        "W_constraint": null, 
        "b_constraint": null, 
        "name": "convolution2d_3", 
        "activity_regularizer": null, 
        "trainable": true, 
        "dim_ordering": "th", 
        "nb_col": 5, 
        "subsample": [
          2, 
          2
        ], 
        "init": "glorot_uniform", 
        "bias": true, 
        "nb_filter": 48, 
        "b_regularizer": null, 
        "W_regularizer": null, 
        "nb_row": 5, 
        "activation": "relu", 
        "border_mode": "valid"
      }
    }, 
    {
      "class_name": "Convolution2D", 
      "config": {
        "W_constraint": null, 
        "b_constraint": null, 
        "name": "convolution2d_4", 
        "activity_regularizer": null, 
        "trainable": true, 
        "dim_ordering": "th", 
        "nb_col": 3, 
        "subsample": [
          1, 
          1
        ], 
        "init": "glorot_uniform", 
        "bias": true, 
        "nb_filter": 64, 
        "b_regularizer": null, 
        "W_regularizer": null, 
        "nb_row": 3, 
        "activation": "relu", 
        "border_mode": "valid"
      }
    }, 
    {
      "class_name": "Convolution2D", 
      "config": {
        "W_constraint": null, 
        "b_constraint": null, 
        "name": "convolution2d_5", 
        "activity_regularizer": null, 
        "trainable": true, 
        "dim_ordering": "th", 
        "nb_col": 3, 
        "subsample": [
          1, 
          1
        ], 
        "init": "glorot_uniform", 
        "bias": true, 
        "nb_filter": 64, 
        "b_regularizer": null, 
        "W_regularizer": null, 
        "nb_row": 3, 
        "activation": "relu", 
        "border_mode": "valid"
      }
    }, 
    {
      "class_name": "Flatten", 
      "config": {
        "trainable": true, 
        "name": "flatten_1"
      }
    }, 
    {
      "class_name": "Dense", 
      "config": {
        "W_constraint": null, 
        "b_constraint": null, 
        "name": "dense_1", 
        "activity_regularizer": null, 
        "trainable": true, 
        "init": "glorot_uniform", 
        "bias": true, 
        "input_dim": 5184, 
        "b_regularizer": null, 
        "W_regularizer": null, 
        "activation": "relu", 
        "output_dim": 1164
      }
    }, 
    {
      "class_name": "Dense", 
      "config": {
        "W_constraint": null, 
        "b_constraint": null, 
        "name": "dense_2", 
        "activity_regularizer": null, 
        "trainable": true, 
        "init": "glorot_uniform", 
        "bias": true, 
        "input_dim": 1164, 
        "b_regularizer": null, 
        "W_regularizer": null, 
        "activation": "relu", 
        "output_dim": 100
      }
    }, 
    {
      "class_name": "Dense", 
      "config": {
        "W_constraint": null, 
        "b_constraint": null, 
        "name": "dense_3", 
        "activity_regularizer": null, 
        "trainable": true, 
        "init": "glorot_uniform", 
        "bias": true, 
        "input_dim": 100, 
        "b_regularizer": null, 
        "W_regularizer": null, 
        "activation": "relu", 
        "output_dim": 50
      }
    }, 
    {
      "class_name": "Dense", 
      "config": {
        "W_constraint": null, 
        "b_constraint": null, 
        "name": "dense_4", 
        "activity_regularizer": null, 
        "trainable": true, 
        "init": "glorot_uniform", 
        "bias": true, 
        "input_dim": 50, 
        "b_regularizer": null, 
        "W_regularizer": null, 
        "activation": "relu", 
        "output_dim": 10
      }
    }, 
    {
      "class_name": "Dense", 
      "config": {
        "W_constraint": null, 
        "b_constraint": null, 
        "name": "dense_5", 
        "activity_regularizer": null, 
        "trainable": true, 
        "init": "glorot_uniform", 
        "bias": true, 
        "input_dim": 10, 
        "b_regularizer": null, 
        "W_regularizer": null, 
        "activation": "tanh", 
        "output_dim": 1
      }
    }
  ]
}